In [1]:
try:
    file = open("data.csv","x")
    file.close()
except:
    print("This name already exist")

In [7]:
import pandas as pd
df = pd.read_csv("data.csv")
print(df)

   SN     name  age      add       phone
0   1  Chandra   26      Pkr   980667407
1   2    Jyoti   24      Ktm  9806759842
2   3     Katy   30  Chitwan  9803454322
3   4      Bob   29   Dharan  9803456781
4   5     Mark   40    Patan  9834567870
5   6   Taylor   33      Bkt  9823456709

In [11]:
import pandas as pd
df = pd.read_csv("data.csv", nrows = 5, index_col = "SN")
print(df)

       name  age      add       phone
SN
1   Chandra   26      Pkr   980667407
2     Jyoti   24      Ktm  9806759842
3      Katy   30  Chitwan  9803454322
4       Bob   29   Dharan  9803456781
5      Mark   40    Patan  9834567870

In [13]:
df['phone']

SN
1     980667407
2    9806759842
3    9803454322
4    9803456781
5    9834567870
Name: phone, dtype: int64

In [14]:
df["name"] == "Mark"

SN
1    False
2    False
3    False
4    False
5     True
Name: name, dtype: bool

In [17]:
df[df["name"] == "Mark"]

    name  age    add       phone
SN
5   Mark   40  Patan  9834567870

In [18]:
df["age"] >= 30

SN
1    False
2    False
3     True
4    False
5     True
Name: age, dtype: bool

In [19]:
df[df["age"] >= 30]

    name  age      add       phone
SN
3   Katy   30  Chitwan  9803454322
5   Mark   40    Patan  9834567870

In [20]:
data = df[df["age"] >= 30]
data

    name  age      add       phone
SN
3   Katy   30  Chitwan  9803454322
5   Mark   40    Patan  9834567870

In [21]:
data.to_csv("new_data.csv")

In [31]:
data = df[(df["age"] > 20) & (df["add"]=="Patan")]
data

    name  age    add       phone
SN
5   Mark   40  Patan  9834567870

In [35]:
#Dataframe 
data = {"name": ["Hari","Mark","Sam"],
       "age": [23,45,57],
       "add":["Pkr","Ktm","Dharan"]}
df = pd.DataFrame(data)
df.to_csv("new_ccc.csv")
print(df)

   name  age     add
0  Hari   23     Pkr
1  Mark   45     Ktm
2   Sam   57  Dharan

In [36]:
import pandas as pd
df = pd.read_csv("data.csv", index_col = "SN")
print(df)

       name  age      add       phone
SN
1   Chandra   26      Pkr   980667407
2     Jyoti   24      Ktm  9806759842
3      Katy   30  Chitwan  9803454322
4       Bob   29   Dharan  9803456781
5      Mark   40    Patan  9834567870
6    Taylor   33      Bkt  9823456709

In [46]:
df.iloc[1:3]

       SN  age      add       phone
name
Jyoti   2   24      Ktm  9806759842
Katy    3   30  Chitwan  9803454322

In [44]:
df = pd.read_csv("data.csv", index_col = "name")
df.loc["Chandra":"Bob"]

         SN  age      add       phone
name
Chandra   1   26      Pkr   980667407
Jyoti     2   24      Ktm  9806759842
Katy      3   30  Chitwan  9803454322
Bob       4   29   Dharan  9803456781